{"CSC265": {"wordcloud_path": "Wordcloud_image/CSC265.txt", "score": 0.07414503502942925, "top_reviews": [["For you, anything that involves human interaction", "https://redd.it/985n7o"], ["why you take all bird courses", "https://redd.it/985n7o"], ["https://imgur.com/a/4BtkPgw", "https://redd.it/985n7o"], ["Teach me your ways plz, will watching Ricky and Morty once be enough?", "https://redd.it/985n7o"], ["0/10 shitpost ", "https://redd.it/985n7o"], ["This guy is legit", "https://redd.it/985n7o"], ["MAT257 bb. i'm down for anything ;)", "https://redd.it/69vvpr"], ["take csc343 with me \n\nid love to query ur database if u kno what i mean", "https://redd.it/69vvpr"], ["Math courses in general are harder than cs courses, because it requires more abstract thinking as you take upper year math courses. As a cs specialist, I got very good mark in mat137, 223, 235 and 224.. But I decided to not go into further study in mathematics, because most of 300 level mat courses require that you have taken 257/246 or got really good mark in 237.... I would have to say mat257 is harder than any cs courses... yes including csc373...", "https://redd.it/7fhhle"], [">  what's to stop me from enrolling in 265 (which lists 207 as a corequisite) and dropping down to 263? \n\nKicking you out of 263 again", "https://redd.it/d67qnj"]]}}{"ABP100": {"wordcloud_path": "Wordcloud_image/ABP100.txt", "score": -1.0, "top_reviews": []}}{"ECO200": {"wordcloud_path": "Wordcloud_image/ECO200.txt", "score": 0.08020077658862027, "top_reviews": [["slash means \"or\", comma or semicolon means \"and\"", "https://redd.it/cahbv3"], ["So like, what do you actually want advice on?", "https://redd.it/8n8eor"], ["also anyone know where the eco200 midterm is taking place today?", "https://redd.it/5cdsmy"], ["50/50.  Either you get in, or you don't.  ", "https://redd.it/6scsc1"], ["pretty sure as long as you wrote the correct exam, you'll be fine. ", "https://redd.it/8bwv1k"], ["Way easier than ECO200s. \n\nThe higher you get the less work. 300s are still difficult, but 400s are easier. \n\nThere are some courses like the econometrics that are still lots of assignments and essays. But once you get to a level 300s and 400s start becoming more readings and essay writing. So it really depends on the specific courses. I've found they make you think more than the 200s because at that point its less about plugging in answers and more about critical thinking.", "https://redd.it/fyffmm"], ["If you’re going for graduate studies in economics, ECO206 and ECO208 are definitely the way to go, partly because they prepare you better for more advanced 300/400 series theory courses. However you can definitely still succeed with ECO200/202. It’s not as vital as say, not taking more courses in math and mathematical statistics.", "https://redd.it/g1m8jq"], ["You have a maximum of 2.0 course load over the summer. 1.0 per term.\n\nIn term of the course load, its definitely feasible, easier than during the semester but you lose a bit of your summer. (From my own experience) ", "https://redd.it/ami2pp"], ["Because they don't want to publicize how much the strike is affecting the university. They want a veneer of \"business as usual\".", "https://redd.it/2xpv10"], ["From what I've heard, the jump from 105 to 200 is very intense. U'd have to brush up ur calc. As far as reviewing eco101 and 102 notes, that'll definitely help", "https://redd.it/fzxnkr"]]}}